Tekla Open API Reference for Tekla Structures 2025
StraightDimensionSetHandler.CreateDimensionSet Method (ViewBase, PointList, Vector, Double, Double, Double)
 Creates straight dimensions and combines them to one straight dimension set. Returns null if fails.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public StraightDimensionSet CreateDimensionSet(
	ViewBase View,
	PointList DimensionPoints,
	Vector UpDirection,
	double Distance,
	double LeftTagLineOffset,
	double RightTagLineOffset
)
Public Function CreateDimensionSet (
	View As ViewBase,
	DimensionPoints As PointList,
	UpDirection As Vector,
	Distance As Double,
	LeftTagLineOffset As Double,
	RightTagLineOffset As Double
) As StraightDimensionSet
Parameters
View
Type: Tekla.Structures.Drawing.ViewBase
The view to be used.
DimensionPoints
Type: Tekla.Structures.Drawing.PointList
The dimension points to be used.
UpDirection
Type: Tekla.Structures.Geometry3d.Vector
The direction from the dimension points to the dimension line.
Distance
Type: System.Double
The distance in paper millimeters taken from the first dimension point to the dimension line.
LeftTagLineOffset
Type: System.Double
The left tag line offset measured in paper millimeters.
RightTagLineOffset
Type: System.Double
The right tag line offset measured in paper millimeters.
Return Value
Type: StraightDimensionSet
The created straight dimension set or null if fails.
See Also
Reference
StraightDimensionSetHandler Class
CreateDimensionSet Overload
Tekla.Structures.Drawing Namespace